package com.example.all_android_projects.country.data

enum class CountryEnum(
    val imageUrl: String,
    val capital: String,
    val information: String,
    val moreInformation: String,
    val independenceDay: String
) {
    ARMENIA(
        "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2f/Flag_of_Armenia.svg/1920px-Flag_of_Armenia.svg.png",
        "Country name Armenia",
        "Պաշտոնական անվանումը՝ Հայաստանի Հանրապետություն",
        "Պետություն Առաջավոր Ասիայում՝ Հայկական լեռնաշխարհի հյուսիսարևելյան մասում։ Քաղաքական և մշակութային իմաստով, սակայն, գտնվում է հարավարևելյան Եվրոպայի Կովկասյան տարածաշրջանում։ Հյուսիսում սահմանակցում է Վրաստանին, արևելքում՝ Ադրբեջանին, հարավում՝ Իրանին, իսկ արևմուտքում՝ Թուրքիային։ Հարավարևելյան կողմում Բերձորի միջանցքով կապվում է Արցախի Հանրապետությանը, իսկ հարավ-արևմուտքում Ադրբեջանի էքսկլավ Նախիջևանի Ինքնավար Հանրապետությունն է։ Այժմյան ՀՀ-ն զբաղեցնում է պատմական Հայաստանի տարածքի միայն մեկ տասներորդը՝ Այրարատ և Սյունիք նահանգների մի մասը",
        "Independence day 21 09 1991"
    ),
    ARGENTINA(
        "https://cdn.britannica.com/69/5869-004-7D75CD05/Flag-Argentina.jpg",
        "Country name Argentina",
        "Պաշտոնապես Արգենտինայի Հանրապետություն",
        "Տարածքի մեծությամբ երկրորդ տեղն է զբաղեցնում մայրցամաքում (Բրազիլիայից հետո), ութերորդը՝ աշխարհում, իսկ բնակչության թվաքանակով երրորդն է Հարավային Ամերիկայում։ Կազմված է 24 վարչական միավորից՝ 23 պրովինցիայից և Բուենոս Այրես դաշնային մայրաքաղաքային շրջանից։ Զբաղեցնում է Հարավային Ամերիկայի հարավային մասը, որը կոչվում է Պատագոնիա։ Արևմուտքից սահմանակից է Չիլիին, հյուսիսից՝ Բոլիվիային և Պարագվային, հյուսիս-արևելքից՝ Բրազիլիային և Ուրուգվային։ Արևելքում ափերը ողողում են Ատլանտյան օվկիանոսի ջրերը։",
        "Independence day 09 07 1816"
    ),
    PORTUGAL(

        "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5c/Flag_of_Portugal.svg/1280px-Flag_of_Portugal.svg.png",
        "Country name Portugal",
        "Պաշտոնական անվանումը՝ Պորտուգալիայի Հանրապետություն",
        "Ինքնիշխան պետություն Հարավային Եվրոպայում՝ Պիրենեյան թերակղզու վրա։ Համարվում է մայրցամաքային Եվրոպայի ամենաարևմտյան պետությունը, որն արևմուտքում և հարավում սահմանակից է Ատլանտյան օվկիանոսին, իսկ հյուսիսում և արևելքում՝ Իսպանիային։ Պորտուգալա-իսպանական սահմանի ընդհանուր երկարությունը կազմում է 1214 կմ․ սա ամենաերկար միջպետական սահմանագիծն է ամբողջ Եվրոպական Միության տարածքում։ Հիմնական ցամաքային տարածքից բացի, Պորտուգալիային են պատկանում նաև Ազորյան կղզիներն ու Մադեյրան, որոնք hանրապետության կազմում ունեն ինքնավարություն։",
        "Independence day 05 10 1910"
    ),
    ITALY(
        "https://upload.wikimedia.org/wikipedia/en/thumb/0/03/Flag_of_Italy.svg/1920px-Flag_of_Italy.svg.png",
        "Country name Italy",
        "Պաշտոնական անվանումը՝ Իտալիայի Հանրապետություն",
        "Տեղակայված է Միջերկրական ծովի սրտում։ Իտալիան ազատ ցամաքային սահմաններ ունի Ֆրանսիայի, Շվեյցարիայի, Ավստրիայի, Սլովենիայի, Սան Մարինոյի և Վատիկանի հետ։ Իտալիայի տարածքը կազմում է 301.338 կմ քառակուսի (116,347 քառակուսի մղոն) և հիմնականում ունի հանգիստ սեզոնային և միջերկրածովային կլիմա։ Իր տեսքի պատճառով հաճախ այն անվանում են lo Stivale (կոշիկ)։ 61 միլիոն բնակչությամբ Իտալիան չորրորդ ամենախոշոր բնակչություն ունեցող երկիրն է Եվրոպական միությունում\n",
        "Independence day 02 06 1946"
    ),
    GERMANY(
        "https://upload.wikimedia.org/wikipedia/en/thumb/b/ba/Flag_of_Germany.svg/2560px-Flag_of_Germany.svg.png",
        "Country name Germany",
        "Պաշտոնապես՝ Գերմանիայի Դաշնային Հանրապետություն",
        "Պետություն Արևմտյան Եվրոպայում, որը Բալթիկ և Հյուսիսային ծովերից ձգվում է մինչև Ալպյան լեռներ և Բոդենի լիճ՝ հարավում հասնելով մինչև հյուսիսային Հռենոս։ Հյուսիսում սահմանակցում է Դանիային, արևելքում՝ Չեխիային և Լեհաստանին, հարավում՝ Ավստրիային և Շվեյցարիային, հարավում՝ Ֆրանսիային, իսկ Լյուքսեմբուրգին, Բելգիային և Նիդերլանդներին՝ արևմուտքում։\n",
        "Independence day 18 01 1871"
    ),
    USA(
        "https://upload.wikimedia.org/wikipedia/en/thumb/a/a4/Flag_of_the_United_States.svg/2560px-Flag_of_the_United_States.svg.png",
        "Country name United States",
        "Հաճախ անվանվում է Միացյալ Նահանգներ, կամ պարզապես Ամերիկա",
        "Դաշնային սահմանադրական հանրապետություն Հյուսիսային Ամերիկայում, որը բաղկացած է որոշակի ինքնավարություն ունեցող 50 նահանգներից, որոնք իրականում կիսանկախ պետություններ են (ինչը արտահայտված է նրանց պաշտոնական անունների մեջ․ օրինակ՝ Կալիֆոռնիան կոչվում է Կալիֆոռնիա Հանրապետություն և դա այժմ էլ գրված է նրա դրոշի վրա), և դաշնային նշանակության Կոլումբիա շրջանից[6][7]։ Ամերիկայի Միացյալ Նահանգները հյուսիսում սահմանակցում է Կանադային[8], հարավում՝ Մեքսիկային, ինչպես նաև՝ ծովային սահման ունի Ռուսաստանի հետ։\n",
        "Independence day 21 10 1959"
    ),
    UNITEDKINGDOM(
        "https://upload.wikimedia.org/wikipedia/en/thumb/a/ae/Flag_of_the_United_Kingdom.svg/2560px-Flag_of_the_United_Kingdom.svg.png",
        "Country name United Kingdom",
        "Աշխարհի հզորագույն կայսրություններից մեկը",
        "Հիմնադրել է Անգլիայի թագավոր Հենրի VII-ը 1497 թվականին։ Գեորգ V-ի թագավորության տարիներին (1910–1936) կայսրության տարածքը կազմել է 34,650,407 քառակուսի կիլոմետր)։ Դա հավասար էր մոլորակի ցամաքի 22%-ին։ Բնակչությունը 1922 թվականին հասնում էր 480 միլիոնի, այսինքն՝ Երկրի բնակչության մեկ քառորդ մասը կայսրության հպատակներն էին։\n",
        "Independence day 05 12 1922"
    ),
    SOUTHKOREA(
        "https://upload.wikimedia.org/wikipedia/commons/thumb/0/09/Flag_of_South_Korea.svg/1200px-Flag_of_South_Korea.svg.png?20210924062624",
        "Country name South Korea",
        "Կորեայի Հանրապետություն Թեգըկգի",
        "Կորեայի Հանրապետության ներկայիս դրոշն ընդունվել է 1948 թվականին։ Այն Թեգըկգի դրոշի (կորեերեն՝ 태극기, թարգ․՝ Մեծ Սկզբի դրոշ) փոփոխված տարատեսակն է․ Թեգըկգին՝ որպես պետական դրոշ օգտագործել են և՛ Չոսոնի (1883–1897), և՛ Կորեական կայսրության (1897–1910), և՛ Կորեայի Հանրապետության ժամանակավոր կառավարությունները։ Օրիգինալ Թեգըկգին ստեղծել է Չոսոնի թագավորության թարգմանիչ Լի Ընգ Ջունը (կորեերեն՝ 이응준) 1882 թվականին։\n",
        "Independence day 15 10 1948"
    ),
    RUSSIA(
        "https://upload.wikimedia.org/wikipedia/en/thumb/f/f3/Flag_of_Russia.svg/1280px-Flag_of_Russia.svg.png",
        "Country name Russia",
        "Պաշտոնական անվանումը՝ Ռուսաստանի Դաշնություն",
        "Տարածքի հիմնական մասը գտնվում է Հյուսիսային Ասիայում, իսկ որոշակի հատված նաև Արևելյան Եվրոպայում։ Ռուսաստանն աշխարհի խոշորագույն պետությունն և զբաղեցնում է երկրագնդի ցամաքային տարածքի 1/8-ը[10]։ Բնակչության թվով 9-րդն է աշխարհում․ ըստ 2018 թվականի մարդահամարի տվյալների՝ Ռուսաստանի բնակչության թիվը կազմում է ավելի քան 144 մլն մարդ։ Երկրի ազգաբնակչության 77 %-ը կենտրոնացված է արևմուտքում՝ եվրոպական հատվածում, որտեղ էլ տեղակայված է քաղաքամայր Մոսկվան։ Վերջինս համարվում է Եվրոպայի խոշորագույն քաղաքը, ինչպես նաև խոշորագույններից մեկն ամբողջ աշխարհում։\n",
        "Independence day 16 01 1547"
    ),
    UGANDA(
        "https://upload.wikimedia.org/wikipedia/commons/thumb/c/ca/Flag_of_Iran.svg/2560px-Flag_of_Iran.svg.png",
        "Country name Uganda",
        "Պաշտոնապես՝ Ուգանդայի Հանրապետություն), պետություն է Արևելյան Աֆրիկայում",
        "Բրիտանական համագործակցության անդամ է։ Երկրի տարածքն զբաղեցնում է Արևելաաֆրիկական սարահարթի հյուսիսարևմտյան մասը։ Գերակշռում են 1100–1500 մ բարձրության բլրավոր հարթավայրերը։ Կան բարձր լեռնազանգվածներ (Ռուվենզոր, 5109 մ), հրաբուխներ, հարավ-արևմուտքում Վիրունգա հանգած հրաբուխների խումբն է (Մուխավուրա հրաբուխ, 4127 մ), հարավ-արևելքում՝ Էլգոն հրաբուխը (4322 մ) և այլն։ Ընդերքը հարուստ է երկաթի, ցիրկոնիումի, ապատիտի, բազմամետաղների, ոսկու, թանկարժեք քարերի պաշարներով։\n",
        "Independence day 09 10 1963"
    ),
    FRANCE(
        "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4e/Flag_of_Uganda.svg/1280px-Flag_of_Uganda.svg.png",
        "Country name France",
        "Հայտնի նաև որպես Ֆրանսիա ունիտար կիսանախագահական հանրապետություն",
        "Արևմտյան Եվրոպայում իր մի քանի անդրծովյան տարածքներով և կղզիներով, որոնք տեղակայված են Հնդկական, Խաղաղ և Ատլանտյան օվկիանոսներում։ Մայրցամաքային Ֆրանսիան ձգվում է Միջերկրական ծովից մինչև Անգլիական նեղուց և Հյուսիսային ծով, Հռենոսից մինչև Ատլանտյան օվկիանոս։ Նրան հաճախ անվանում են վեցանկյուն նրա տարածքի աշխարհագրական պատկերի պատճառով։ Այն Արևմտյան Եվրոպայի խոշորագույն երկիրն է և երկրորդ ամենամեծը աշխարհում իր բացառիկ տնտեսական գոտով 11,035,000 կմ2՝ զիջելով միայն Միացյալ Նահանգներին (11,351,000 կմ2 / 4,383,000 ք մղոն)։\n",
        "Independence day 04 10 1958"
    )
}